{
  "posts": [
    {
      "content": "<p>And suddenly, a year has passed. Just like that. Another year older, perhaps wiser. Hopefully wiser.</p>\n<p>I feel each year carries a heavier toll - the inevitable passage of time. At first lumbering, but gradually speeding up as the days fly past. Each year seems to go by faster.</p>\n<p>This year leaves quite a few broken promises, friends lost, regrettable choices, and unfulfilled wishes. But it also was a year of great moments, of treasured memories, and many, many life lessons. So here&#39;s to ruminating thoughts, to future hopes, and to promises. One of which is that I will write more - especially for myself.</p>\n<hr>\n<h4 id=\"-feelings-of-invincibility\">// feelings of invincibility</h4>\n<p>When I was younger, I used to think that time would bring solutions and answers to the countless questions of life. But in some ways I sense a loss of wonder and magic, as mysteries unravel. Nonetheless, I am a stronger person than I was one, three, five, ten years ago.</p>\n<p>One wish that&#39;s died was the hope that things could be permanent. That problems could be overcome, solved, never to arise again. I wish I was right.</p>\n<p>I left McGill two and a half years ago - fairly social, fairly confident - yet uncertain of my place in the world. I left Waterloo a year ago - sure that this new city would change everything. I was sure of myself, confident that this was the right path, and that everything would fall into place.</p>\n<p>Yet I think it&#39;s a sobering realization that things left unmaintained, unpracticed, do gradually fail. And sometimes without even realizing.</p>\n<p>I was so sure that some of these problems that I had cockily considered &quot;fixed/solved&quot; - questions of genuineness, loyalty, kindness, personal happiness, etc., or so confident that externals would make up for everything - that I had ignored them.</p>\n<p>Perhaps it&#39;s time to <em>Begin Again</em>.</p>\n<ul>\n<li>coincidentally one of my favorite Taylor Swift songs</li>\n</ul>\n<hr>\n<h4 id=\"-letting-go-trying-again\">// letting go &amp; trying again</h4>\n<p>Sometimes it&#39;s about letting go of the past, and trying again.</p>\n<p>I know I&#39;ve failed. I&#39;ve failed often. And sometimes I&#39;m way to hard on myself on these failures. I think this blog is almost a testament to that.</p>\n<p>But it <em>is</em> about trying again. It&#39;s about picking up the pieces, apologizing for mistakes, and starting again. It&#39;s going back to humility, to self-doubt, and to openness.</p>\n<p>I can&#39;t say this is - or will be - easy. I&#39;m someone with a lot of regrets, someone who overanalyzes and overthinks every little detail. I harbor grudges, dislikes, times wronged, and so on. But it is time to let go. I want to believe that attitude is a choice. I may not have control of what others do or think - but I can control myself. I can forgive others - forgive myself.</p>\n<hr>\n<h4 id=\"-patterns-promises\">// patterns &amp; promises</h4>\n<p>I know I&#39;ve failed many times before. The road to self-improvement and self-actualization is a long one, it seems. I&#39;ve failed goals, broken promises.</p>\n<p>It seems like each time, I make commitments and plans to reach whatever goals were on my mind at the time. Actionable tasks like going to the gym weekly, cooking more, and so on, to more nebulous goals like being kinder and living more in the moment. Sometimes, these goals are fulfilled, while others are simply left by the wayside.</p>\n<p>I&#39;ve always wanted to be better - and I always will want to. I want to believe though, that these are temporary hiccups. Sometimes things don&#39;t work out, and there&#39;s a reason for it. Maybe I just wasn&#39;t the right person. Maybe I am now.</p>\n<p>My current goal is simple - do something each day to make tomorrow brighter. Whether that&#39;s studying or learning, or enshrining a beautiful moment to memory, or being healthy and eating better - it&#39;s to have small steps to go forward. Of course, as always there&#39;s so many things I want to do. But I know for sure I can&#39;t juggle twenty different items at the same time. I used to believe that it was all or nothing, that it was better to dive into the deep end and swim or sink trying. Maybe gradually ramping up, leaving old patterns and habits behind and adopting new ones, will help.</p>\n<p>So this isn&#39;t just a promise to try again. This is just what will be - what has to be. Maybe this time won&#39;t be the last time I fail and start over, but it will be (n-1) times less.</p>\n<hr>\n<h4 id=\"-closing-thoughts\">// closing thoughts</h4>\n<p>I want to restart/start either dinner or cocktail club. The premise is fairly simple - come over for food/drinks - bring something small [if you can], but come over for company. I&#39;ll provide food and/or drinks, as long as you&#39;re okay with experimenting with new foods and/or new cocktails and drinks! If you&#39;re interested - message me - or I&#39;ll message you eventually too.</p>\n<p>I need to go back to doing these personal projects for myself, and having both short and long term goals. And maybe it&#39;s just for myself - writing, hanging out meaningfully, creating something new, but that&#39;s fine too. It&#39;s been too easy sitting around, waiting for things to <strong>happen</strong>. But life - true, exhilirating, breathtaking life - won&#39;t just happen to us. We&#39;ll need to reach out, and find it.</p>\n<p>I&#39;ve found a bit of magic, and it has brought happiness, joy and wonder into my life.</p>\n<p>But now, it&#39;s time to try. It&#39;s time to look forward. It&#39;s time to find meaning and dreams, or to create them. And on a Wednesday, in a cafe... I watched it <em>Begin Again</em>.</p>\n",
      "data": {
        "title": "Begin Again",
        "date": "2018-10-08T00:00:00.000Z",
        "blurb": "But on a Wednesday, in a cafe, I watched it begin again."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>It&#39;s been five months in Toronto, and five months since I last wrote. I think, that looking back, I feel that many of the struggles were worthwhile.</p>\n<p>For me, the city has felt amazing.  It&#39;s so nice seeing so many people out and about, being walking  (or at least biking) distance from everything interesting, and being in a vibrant, exciting location.</p>\n<p>I&#39;ve been <em>so</em> busy with work and getting settled in. Part of it is startup life, part of it might be due to my own... inferior time management skills. But hey, my apartments basically furnished, I have what I need, and so on. Time to restart my life (like, this time, actually) again in Toronto.</p>\n<p>I think I genuinely love what I do, but I still have that seed of doubt that I&#39;m not (or that I won&#39;t be) good enough, that it&#39;s not for me, or that it won&#39;t be a long term thing.</p>\n<p>But hey, it works for now. And I think I&#39;m happy. Or happier.</p>\n<p>Plus life itself is still waiting.</p>\n<hr>\n<h4 id=\"ambition\">Ambition</h4>\n<p>Being in a larger city has definitely exposed me much more to the potential in life - at least career wise. There are so many hardworking, brilliant, and talented people out there. Maybe enough to tamper down the cockiness (unlikely), but definitely enough to inspire me to do more. There&#39;s so many different people in this city, with such interesting backgrounds, and diverse futures. It&#39;s been a pleasure to meet so many of them, and to hear their stories and dreams. So many are inspirations.</p>\n<p>It feels good to be doing something that I really enjoy. I&#39;ve had some pretty busy (and pretty stressful) weeks at work, but it&#39;s still fun. I feel like I&#39;m learning a ton, and there&#39;s always more to improve in. Tech seems to be a wonderful community, full of welcoming people dreaming to make the world a better place.</p>\n<p>However, I worry a bit about goals. I feel like in many ways, I feel less of a sense of higher purpose. I worry that if anything, despite loving the daily process, the work, and the learning, I feel money is becoming a primary concern. I notice in my conversations too. And in this, I can&#39;t blame anyone but me. Maybe it&#39;s prudence - that as independent adults we must care about our financial habits and think about our future. I think there&#39;s a bit of that. I think there&#39;s a bit of greed too. There&#39;s so many shiny toys. A brand new laptop. The latest Pixel or iPhone. New, flashy clothing to try and fit in (or try and stand out) in a different environment.</p>\n<p>I don&#39;t know. Sometimes I go to these networking events - and I meet really interesting people, with which we can just debate passions - say Angular vs. React, or the impact of AI on the future. Other times, I really feel that many people (and often myself included) are just there to hopefully meet someone to give them a better opportunity, flirting from conversation to conversation as a serial network, looking for the next more important person.</p>\n<p>I think I still care. I think I really do want to make a difference in the world. But I also want to be comfortable, do fun things, and so on.</p>\n<p>I love what I do, I really do. And I do want to be the best (or the best I can be - aka #1) at it.</p>\n<hr>\n<h4 id=\"the-pursuit-of-happiness\">The Pursuit of Happiness</h4>\n<p>Switching lives has not been a cure for every problem. I know that somewhere in the past year(s), I&#39;ve lost a lot of friends and many hobbies. I know I don&#39;t practice piano as much as I used to. I know I don&#39;t take as much time to cook. I don&#39;t read much, I don&#39;t explore as much. I don&#39;t have as many people over for dinners or drinks.</p>\n<p>Part of it is some fairly drastic life changes. Jumping three cities, three career fields. New city, new me. I&#39;ve spent a lot of time recently working, from self-studying coding while working a full-time job, to drastically trying to catch up in performance and be the best I can be. Part of it is adjusting, becoming comfortable again. Part of it is losing a razor-sharp focus on the immediate next thing I need to do and to do now, and becoming</p>\n<p>It&#39;s still something I&#39;m chasing though. I&#39;ve had some great moments recently, and I&#39;m trying to find more <a href=\"https://medium.com/fast-company/the-power-of-moments-why-certain-experiences-have-extraordinary-impact-80fce59a1ab7\">(as a side note, this was a really great read -unfortunately paywalled)</a>. But hey, life is full of the search.</p>\n<p>Objectively, life seems good - and is getting better.</p>\n<p>I do reminisce though. I think I&#39;m still missing some things. A true feeling of warmth and belonging. A close circle of nearby friends. Many enjoyable moments.</p>\n<p>Part of it almost feels like an inability to connect, perhaps an fear of being open and true with myself. And then fighting for attention in groups, trying to be the same center of attention as always. Maybe I&#39;m not as funny as I was (psh), but maybe too that I&#39;m trying to fill emptiness with braggery and bravado - and letting things like kindness and real friendship slip by the wayside.</p>\n<p>Right now - I think in some ways I need to take a step back. Stop trying to force things. Stop trying to impress, to shock, to elicit response for the sake of response. Be genuine, etc. And maybe accept that some things are unlikely to ever work out - even as friends some people just aren&#39;t compatible.</p>\n<p>In other ways, it&#39;s to start using time for others again. Not just accepting invites and being passive, but being proactive in bringing people together. To make memories, and to make memories that are just as bright and genuinely great as the old ones.</p>\n<p>I think I do need to take more time for myself. More time to pursue those random whims and random interests, to chase dreams of a different kind. But as all things, they&#39;re getting better. I hope to restart dinner clubs very, very soon.</p>\n<hr>\n<h4 id=\"in-search-of-magic\">In Search of Magic</h4>\n<p>No, this was not planned as a rant against my dating life.</p>\n<p>No, this won&#39;t turn into one.</p>\n<p>One thing that I am strongly searching for - is the magic.</p>\n<p>I&#39;ve had good moments recently, great moments even. But still, I&#39;m searching for those sparks, those perfect moments, those <strong>moments of magic</strong>.</p>\n<p>I worry that I&#39;m having trouble forming deep, meaningful connections with new people. I&#39;m interesting, nice and can hold a decent conversation (I think). I&#39;ve had some great experiences, fun times with dates (and/or friends) and nothing talks.</p>\n<p>But thus far, nothing clicks.</p>\n<p>I wonder if it&#39;s something to do with the setting - an overreliance on internet devices and perhaps skewed expectations. There&#39;s such low investment into each meeting, with the expectation that even if thing&#39;s were to go wrong, there&#39;s still someone waiting out there. Maybe this percieved abundance devalues each interaction, or devalues each individual - because there could always be something or someone more perfect.</p>\n<p>Maybe it&#39;s a loss of hobbies, as I settle far too much into work. Maybe I&#39;m less interesting.</p>\n<p>Maybe it&#39;s routines, as doing the same experience dozens of times allows it to become a habit - comfortable, but boring. Getting a coffee or drink can only be unique and memorable so many times, and a conversation without the comfort to really dig at the personal, moving topics can only be so deep. </p>\n<p>Maybe I just need some time.</p>\n<p>This is my goal for the next months - to find magic.</p>\n<p>Not just in dating, but in life. In inspiration. To find more meaningful moments, beautiful moments, where everything comes together for even that one second of bliss.</p>\n<p>To ignore all the shitty, scary, uncomfortable times when things aren&#39;t calibrated yet, and when things fall apart.</p>\n<p>And if I can&#39;t find magic - I&#39;ll create it.</p>\n<hr>\n<p>Once again, I&#39;ve been letting this sit way too empty. I think I&#39;m getting a bit disconnected.</p>\n<p>Life is actually good though - there&#39;s very little to complain about. It&#39;s more about being hungry for more, and trying to design/create something better.</p>\n<p>I think sometimes that I judge these posts too hard, that I wait for something <em>perfect</em> befor posting it. But hopefully I&#39;ll write more. I&#39;m currently in Boston, having gone through New York City - and I do have some inspirations.</p>\n<p>Although... there&#39;s something cool I want to do with cinemagraphs and GIFs first. And there&#39;s always something interesting to build.</p>\n<p>But hey, I&#39;m hoping for some magical moments to write about.</p>\n<p>With love.</p>\n",
      "data": {
        "title": "In Search of Magic",
        "date": "2017-10-07T00:00:00.000Z",
        "blurb": "To dream, to love, and to wonder."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>So - big news for me. I&#39;ll be <em>finally</em> moving to <strong>Toronto</strong>!</p>\n<p>I&#39;ll be starting as a Junior Software Developer at <a href=\"https://www.quartermaster.house/\">Quartermaster</a>.</p>\n<hr>\n<p>Let&#39;s get this out of the way. It feels fucking good. It&#39;s like validation. That someone recognizes that I can do this. The feelings of triumph, of giddiness, of relief.</p>\n<p>It&#39;s a new start. Months of self-studying with no clear goal done, but now it&#39;s time to go further - with a team. I&#39;m already really looking forward to the new challenges that await.</p>\n<p>I&#39;m excited to be working on some fairly cutting-edge stuff, and very excited to see exactly how much I&#39;ll grow as a person.</p>\n<hr>\n<p>On the other side - I&#39;m really nervous. What if I&#39;m not ready? What if I&#39;m not good enough - and everyone realizes I&#39;m just an imposter?</p>\n<p>I don&#39;t know how to solve that.</p>\n<p>I&#39;ve been self-learning coding, but I fear I will always feel behind those who graduated with professional degrees. There&#39;s a lot I know I haven&#39;t been exposed to, from academic principles to the culture and environment of computer science. </p>\n<p>I don&#39;t know how to catch up with that, although I think I will take courses to cover as much as I can. I expect I&#39;ll need something along the lines of Algorithms, Data Structures, Design, and Operating Systems. Maybe if I can, brush up on linear algebra and multivariable calculus too. Ugh.</p>\n<hr>\n<p>Moving to Toronto will, hopefully, be amazing. Waterloo, as nice as it was, just hasn&#39;t been enough. I&#39;m really looking forward to summer, and all the events that it will bring. I want to meet interesting people who can challenge me, and maybe (ok very hoping on this one) a cute girl. I want to try fun things, and let this be a great few years in my life.</p>\n<p>Living downtown again will be exciting, being able to go out on my own, set my own schedules, live my own life again, etc. We&#39;ll see how that works out.</p>\n<p>So, if you&#39;re in Toronto, come - let&#39;s grab a drink (or ten) or coffee, and catch up.</p>\n<hr>\n<p>I&#39;m fairly sure this marks a permanent break from medicine. Maybe I&#39;ll eventually go into the computational sides of biological and medical sciences, but I doubt that.</p>\n<p>Having slowly become more tuned into tech news and culture, it&#39;s been absolutely amazing. There&#39;s so many good people in the field, passionate people who are a joy to talk to and argue with. And there&#39;s always big things happening, and bigger things on the horizon.</p>\n<p>I&#39;m more and more certain this is something that I am absolutely in love with, but of course I still have doubts. Maybe a bit more rueful and regretful I chose a different path initially, but nonetheless happier.</p>\n<p>About myself personally - I think I&#39;m happy. Happier at least. I have a plan to move forward, and it seems things are moving well. I don&#39;t think I&#39;m satisfied yet, but perhaps that will come with age.</p>\n<hr>\n<p>As to this blog? Ugh. I did intend to write every week or two, but I always delay putting things online. I do have a few wireframes and mostly-finished pieces, but I am concerned my writing is not the greatest. I do plan on picking back up, especially as more drastic changes come back into life. :)</p>\n<p>I might be building v4 soon. <em>Might</em>.</p>\n<p>With Love.</p>\n",
      "data": {
        "title": "Next Steps",
        "date": "2017-05-20T00:00:00.000Z",
        "blurb": "I am so excited to be able to have this opportunity."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>Oops, this is the first update in almost three months - and exactly 6 months from the first post ever. As good a place as any to pick things back up.</p>\n<p>Today also marks the first day of spring. A great day for new beginnings.</p>\n<hr>\n<h4 id=\"life\">Life</h4>\n<p>The past months have been very... different. Not to complain constantly, but the feelings of loneliness and meaninglessness were prevalent. But I think it&#39;s getting better.</p>\n<p>I&#39;ve had to deal with the feelings that I&#39;m wasting my time and potential, that I&#39;m much too good for this. But that&#39;s changing too. I still do feel that I could have done more with the past months, such that I could be smarter and better now, but that regret isn&#39;t realistic. I have grown in these months, even if I had not realized it at the time.</p>\n<p>Part of it is the loneliness - any problems I had, I had to overcome on my own. It&#39;s left a lot of time for thinking and trying new things, without the perspective, judgment or support of others. Sure, I was never more than a call away from friends, but it gave me the opportunity to grow on my own and understand myself better. </p>\n<p>I&#39;m still uncertain about many things, but that&#39;s natural. What I do know better are many of the qualities (and negatives about myself). I think I&#39;m more patient, more willing to work hard, and perhaps more dedicated. I believe that I&#39;m more genuinely happy now, rather than the extreme highs and lows of a party lifestyle. I&#39;ve recognized (and have been working on) some of my imperfections, from my fear of trying new things to listening to others.</p>\n<p>Hey, that had to change somehow.</p>\n<hr>\n<h4 id=\"the-future\">The Future</h4>\n<p>In the &#39;normal&#39; view of society, the 20&#39;s are some of the last opportunities to really explore and have fun. There&#39;s so many expectations - that you start your career, start a family, settle down into something &#39;respectable&#39;. </p>\n<p>In many ways, this view is so disappointing. It&#39;s the idea of conformity, that there&#39;s a set path to follow, and that happiness is something so socially defined. We&#39;re expected to do as society details, go into something comfortable, do things for the sake of respect, and so on. All the while sacrificing any of your own dreams that don&#39;t align.</p>\n<p>Not to say that this is an invalid dream. For many, family, or monetary success, etc., is something they value highly, and something that will bring fulfillment. Truthfully, I&#39;d be quite jealous of that.</p>\n<p>But knowing that, as someone who is very unhappy with the prospect of settling for things that he doesn&#39;t love, that seems like the greatest risk of all. I think that, with a few more application cycles, I could&#39;ve made it to medicine. Would I have been ultimately happy? Maybe. But that was a risk that I decided not to take, and one that, looking back, I&#39;m glad to have not taken.</p>\n<p>This is the time to try for love, to try for passion. Pushing that search back further won&#39;t result in a better day, ten, twenty, thirty years for now. There won&#39;t be a better opportunity, no magical revelation waiting, without an honest and wholehearted attempt.</p>\n<p>So why not now? And if not now, when?</p>\n<hr>\n<h4 id=\"passion\">Passion</h4>\n<p>I revisited one of my oldest hobbies and interests, that of computer science and technology.</p>\n<p>Before undergrad, my two main choices were between Medicine and Computer Science, and I ultimately decided to go with Medicine. </p>\n<p>I sort of regret that choice now, but so many of the great memories I&#39;ve had, lessons I&#39;ve learned, would not have existed had I chose the other path. Perhaps if I had, I would be in the same position now, reconsidering the other side. Or perhaps I&#39;d be a completely different person, and perhaps better, but also perhaps worse.</p>\n<p>But regardless, idle fancies.</p>\n<p>I&#39;ve been throwing myself completely into the field of computer science.</p>\n<p>From reading about the latest developments and technologies, to being able to directly see results, and the sweet joy of overcoming a difficult problem, it&#39;s been incredibly rewarding so far. I feel like this is something that makes me want to learn more, constantly. It&#39;s something that&#39;s ever changing, a field with an amazing diversity in problems and solutions. It&#39;s something that&#39;s so challenging, yet creative and so innately applicable to our lives.</p>\n<p>I&#39;m very certain that this is the future of our world. Even in the life sciences, technology is making a strong impact. And I wish to be a part of that.</p>\n<p>It&#39;s something so powerful, affecting so many across the entire planet. And what we&#39;ve seen is only the beginning. Many have called it the Information Age, the Digital Revolution, and so forth, and its impact will only grow.</p>\n<p>To be perfectly honest, I&#39;m still a bit scared. What if I get bored in a few months or years? What if I&#39;m not good enough? What if this isn&#39;t the right path for me?</p>\n<p>But I think those are just little-deaths, the fears that plague us no matter what we do. I do feel strongly about this field, and I have an excitement about learning and applying, and about the future, that has definitely made me happier.</p>\n<p>Now is the time to quell my self-doubts, to risk, and to try.</p>\n<hr>\n<h4 id=\"the-blog\">The Blog</h4>\n<p>In case you haven&#39;t noticed, this blog and website has undergone a complete redesign and rebuild, and for now I&#39;m content with this v3. When v4 is finalized (and it&#39;s a matter of when, not if), it&#39;ll probably be more design changes rather than structural and code ones. There is something I do want to add in regards to blogging, but I&#39;m most importantly looking for feedback regarding design.</p>\n<p>In terms of content - I&#39;m very concerned about professionalism and appearances. I really enjoyed the writing process, and some of the things I&#39;ve heard from my friends in response to my posts. Nonetheless, I fear that they may leave a poor impression, and self-censoring to the point where posts are no longer genuine defeats the entire purpose. I may choose to write more non-personal things, but for now it&#39;s okay.</p>\n<hr>\n<h4 id=\"recommendations\">Recommendations</h4>\n<p>Disclaimer that I&#39;m in a very confusing and formative part of my life right now, so these may have affected me much more strongly. Also extremely cheesy. Spoilers! One recommendation I have on my mind:</p>\n<h5 id=\"tuesdays-with-morrie-mitch-albom\">Tuesdays with Morrie - <em>Mitch Albom</em></h5>\n<p>Recommended by a Jessica Zheng, this book has really told me to dream. To me, it was about making our own values and paths, and finding our own meanings. It&#39;s an acceptance of love, a reminder of the importance of reflection, and a call to live vividly. </p>\n<p>I know, for myself, detachment has been one of my core values. And, much like the protagonist in the book, Mitch, I valued an artificial &#39;success&#39; far too strongly. But this was a call to greater things - to live with love and meaning. Perhaps it&#39;s something that I&#39;ve been missing, perhaps it&#39;s something I need to grow towards.</p>\n<hr>\n<p>I&#39;m very excited what the next months and years will bring. I hope happiness, fulfillment, a cute girl (maybe), and learning. I&#39;m still worried that I am going on the wrong path, but I think it&#39;s time to take a leap of faith, take some risks, and dive in wholeheartedly.</p>\n<p>With love.</p>\n",
      "data": {
        "title": "Spring 2017",
        "date": "2017-03-20T00:00:00.000Z",
        "blurb": "6 months in - a complete revamp and a status update on life."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>Thus ends 2016, a quite tumultuous year for myself, and for the world. </p>\n<p>It&#39;s been a year of great things, and sad things. A year of beginnings and of endings. A year of generalized and vague statements, but also of specific and memorable stories.</p>\n<p>For the world, we saw unprecedented events - Brexit, the Paris Agreements, Trump as president-elect, and so on. And not everything is doom and gloom. We&#39;ve had major technological and scientific breakthroughs, societal changes, and countless uplifting stories. There have been continued positive trends in health, economics, conservation, peace, etc. The world isn&#39;t worse and the future isn&#39;t dimmer - just different. </p>\n<p>For me - I graduated from university. I moved back to Waterloo, and (kind of?) settled down for a year. It&#39;s been a crazy year too, with high highs and (unforunately) low lows.</p>\n<p>But you can find everything about the world online, so this post will be a reflection on my 2016.</p>\n<hr>\n<h4 id=\"ending-undergrad\">Ending Undergrad</h4>\n<p>Objectively, my third and final year in undergrad was my best and favorite year.</p>\n<p>Socially, dinner club and parties were successes. I met a lot of wonderful people, and made lasting friendships and memories. I&#39;m very thankful for that, and I&#39;m happy that I had such a fun year, but also sad to leave everything behind.</p>\n<p>However, life was always colored by the stress and anxiety of uncertainty. I was unsure what I wanted to do (I still am), and quite unhappy with what I was doing. I definitely didn&#39;t give school my all, and put off a lot of urgent responsibilities. Sometimes the stress would get to me, and I think all these influences made for a rollercoaster of a year.</p>\n<p>I&#39;m glad to have had such wonderful friends and a great support network. Nonetheless, these few months were defined by very happy moments and very painful moments, often intermixed.</p>\n<hr>\n<h4 id=\"a-new-beginning\">A New Beginning</h4>\n<p>Starting over at home is different. I&#39;m solidly a big city person - and the small town feel of Waterloo region is not something I enjoy. </p>\n<p>It did, however, give me the opportunity to work on myself relatively free from outside influences. And supposedly away from stress.</p>\n<p>However, my uncertainty didn&#39;t really go away. If anything, it got worse. At least I had a clear objective before, while now I had all the time to pursue what I wanted.</p>\n<p>And unfortunately, too much time can be paralyzing.</p>\n<p>It wasn&#39;t all bad. I did take the time to try and figure myself out, and try and improve myself. Perhaps a better environment would have helped - being (mostly) alone in a different city meant I had to figure it out myself. But on the other hand, it meant that anything I did, I knew that it was for me, and internal motivation would last no matter where I was.</p>\n<hr>\n<h4 id=\"the-state-of-the-world\">The State of the World</h4>\n<p>The giant divisive issue in Canada and North America right now is undoubtedly the election of Trump. Preface that I am not a Trump supporter, but the amount of judgement and hate disappoints me.</p>\n<p>This year has been filled with so much hate and divisiveness, though not only about the election. Maybe it&#39;s an increasing sensitivity of mine, but through Facebook, Reddit, McGill, even in real life, the partisanship of various communities saddens me.</p>\n<p>It&#39;s an issue that I keep seeing on most sides of many issues (super generalistic, I know). It seems that, more than ever, broad sweeping generalizations are used to characterize arguments, and they have been overwhelmingly negative. It&#39;s so easy to base and end a debate on, or to make it about character and emotions, that the facts and truths about any particular issue are almost meaningless.</p>\n<p>Technology and modern society doesn&#39;t help - it&#39;s so easy to surround yourself with the same type of people, and the same continuous thoughts and ideas. Sites are designed to algorithmically feed people the exact articles they want to hear. And dissent is often quashed by the same divisiveness and hate - disagreements can be blocked and ignored, or demonized to such a point that it is easier to hide.</p>\n<p>It&#39;s too easy to attack someone as a racist, a SJW, a libtard, a misogynist - labels that carry such negative connotations that they label itself becomes the debate.</p>\n<p>Along with this comes the idea that everyone&#39;s thoughts and feelings being just as valid as expert opinions, scientific fact, and actual news. There&#39;s been a sense of disbelief in authority, perhaps best seen by the rise of populist candidates. Mainstream media, analysis by professionals in the field, and research and evidence based data can now be swept under the rug.</p>\n<p>I don&#39;t know how to solve these problems, and I don&#39;t know what I can do. I wish we could discuss issues and keep it civil and about the facts. I wish elections were about policy. I wish people would love each other more. But these are just wishes.</p>\n<p>This could probably be a longer topic, but this is my general feeling about the state of the world. Scientifically, technologically, we&#39;re all better than ever. There&#39;s a lot of great things happening, and a lot of potential. I&#39;m just disappointed in many of the human parts.</p>\n<p>And I know that I&#39;m self-censoring too, because some opinions and topics should be avoided. Many issues are so emotionally driven, and disagreeing is hard. Easier not to talk about it - which leads to another slew of issues.</p>\n<hr>\n<h4 id=\"triumphs\">Triumphs</h4>\n<p>Hey, I graduated!</p>\n<p>On a more personal note, I think I have become more self-aware. Being challenged with lack of defined goals and motivation has forced me to analyze myself, in an effort to be better.</p>\n<p>I think I&#39;m much more understanding of my strengths       and weaknesses.</p>\n<p>I&#39;d like to think I understand my unhappiness better, and that I know my motivations and dreams. I can better define my core values, and have a greater understanding of the generalistic ideals that drive me.</p>\n<p>I think I learned a lot, but that&#39;s not something particularly exciting. I honed some of my skills, and developed others.</p>\n<p>And I think I know what to do next - now the hard part is the doing, but that&#39;ll be something to continuously work on. </p>\n<hr>\n<h4 id=\"regrets\">Regrets</h4>\n<p>I wish I tried harder, did things earlier, took more chances, yadda-yadda. The classic generic regrets.</p>\n<p>More specifically, I wish I dealt with my problems better. I have a knack for starting projects and making plans I can&#39;t finish. There&#39;s so many things I worked on for a little bit that I wish I committed to more, and finsihed. </p>\n<p>I wish I had more discipline, and that I could work harder. I wish that I would get off Reddit and Facebook, or whatever distraction took my fancy at the time.</p>\n<p>I wish I was less paralyzed by fears - that I took more risks and procrastinated less. I wish I could reach out for help easier, that I could try hard and admit failures, and so on.</p>\n<p>I wish I started many things earlier, that I had more time to succeed, and that I was already stronger now, but I still believe that it&#39;s never too late.</p>\n<p>But all of these are things that can, and will change. Sure, I&#39;ve failed (many times) already, but hey, hope springs eternal. And I won&#39;t accept defeat.</p>\n<hr>\n<h4 id=\"change\">Change</h4>\n<p>I&#39;ve been reading a lot of self-help (LOL). Some have some good lessons, others great ones, and I&#39;ve been trying to incorporate these.</p>\n<p>I&#39;ve been trying to be a better person. As always, a work in progress.</p>\n<p>I&#39;m still learning, and hopefully will be ready (soon) to embark on the next journey of my life.</p>\n<p>I know - as long as it&#39;s just plans, it doesn&#39;t mean much. I have to actually do. And so many times I&#39;ve failed.</p>\n<p>Doesn&#39;t make it not worth trying again.</p>\n<hr>\n<p>But 2017 will be a new year. Full of new opportunities, and a change to be someone new. That&#39;ll be the next post in a week - plans and hopes for 2017.</p>\n<p>And I hope that when we next meet, we&#39;ll both better.</p>\n<hr>\n<p>With love.</p>\n",
      "data": {
        "title": "A Reflection on 2016",
        "date": "2016-12-27T00:00:00.000Z",
        "blurb": "Looking back on an exciting year, and looking forward to a better one."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>I had the pleasure of spending a wonderful weekend in Montreal.</p>\n<p>To everyone I saw: thank you. It was lovely seeing some beautiful faces, and I treasured the moments we spent together. Especially to those with papers and finals coming soon: thank you for your small sacrifice.</p>\n<p>I managed to (almost) see everyone, and even a special someone from the states.</p>\n<p>I&#39;m very glad that this happened - it was so nice catching up, hearing everyone&#39;s stories - and it was so nice being inspired to do better.</p>\n<hr>\n<p>Going back however, comes with the heavy realization that nothing will ever be the same.</p>\n<p>I chose not to walk past my old apartment (or much in the Milton-Parc community at all), but that had been a place of so much happiness. I&#39;d hate to see it as it is now, darker, lonelier, emptier.</p>\n<p>We&#39;ve all moved on with our lives, and the places we leave behind change.</p>\n<p>I had the opportunity to spend time with both the people I love, and many of the places that I had once been. I&#39;m glad to have experienced it - but it doesn&#39;t feel the same anymore. I&#39;ve changed, and in many ways even in the few short months since graduation.</p>\n<p>I still look back with fondness, but knowing that my memories will forever be filtered with rose-tinted glasses.</p>\n<hr>\n<p>All this comes with the acceptance that nothing will ever quite be the same. You can get the drinks with the same people, in the same bar, but somehow things are different. Personalities change, maybe things don&#39;t click quite as well as before. Experiences change, and we don&#39;t go through the same things anymore. Even the conversation topics change - from talking about girls, parties and games to life crises and uncertain futures.</p>\n<p>The locations aren&#39;t quite the same anymore either - the haunts we used to frequent have changed. Alto&#39;s, the classic late night afterparty (or after-study) restaurant, has closed. My old home sits empty - there&#39;ll be no more weekly dinners, random card nights, or parties. The baristas at El Mundo, my classic study spot, are no longer there. And the bartenders at Gert&#39;s don&#39;t have the same jokes.</p>\n<p>Not that it&#39;s all bad - we&#39;re more mature, stronger, more well-rounded people. We grow, we gain experiences, we become older. Sure, things change, but some things change for the better.</p>\n<p>Some people drift out of life too. It&#39;s hard to expect everyone to stay. Some are out in new cities, living new lives. Others slowly fade away, until these former connections are nothing but a memory. Some were good, maybe great, friends, but now we have nothing.</p>\n<p><img src=\"https://imgur.com/0KHDfIz\" alt=\"alt text\" title=\"Sunset over a beautiful city\"></p>\n<p>When I was small, I had a dream that I would be rich, and I could buy every house in a neighborhood and sponsor all my friends to stay together. We&#39;d play together, chill together, go to the local cafe/restaurant (modern addition: bar) together. Our kids would all grow up together.</p>\n<p>Clearly an impossible dream now, when even close friends and friend-groups, and relationships, inevitably drift apart. But its not because anyone&#39;s a bad person, or is intending to break these bridges. Sometimes life just takes us in different directions.</p>\n<p>When we see each other again, it&#39;s almost like nothing&#39;s changed. We can pick it up right where we left off. And for a day or two, it seems like it&#39;s only been a moment left off in friendship.</p>\n<p>But deeper, we know that things are different now. We&#39;re different people, different lives, different dreams. It&#39;s not good or evil, just life.</p>\n<p>And I&#39;ll always remember the great times we&#39;ve had.</p>\n<hr>\n<p>Nonetheless, it was really nice seeing everyone and everything. They&#39;re mostly fond memories, of dinners and laughter, of coffees and instas, and of adventures. And seeing everyone has allowed me to relive my McGill experience at least a little bit. Sure, it brings back some sadness - that things are changed and gone - but I am so so glad to have experienced them, especially this one more time.</p>\n<p>It&#39;s also a reinforcement that, although some things are ephremal, others are not. I know that distance and time may separate us, but we&#39;re still friends. We will still be there for one another.</p>\n<p>Going back is also an opportunity for reflection - to see exactly how you&#39;ve grown and changed.</p>\n<p>I&#39;m not exactly glad to be in Waterloo - I miss the people that used to be in my life - their company, their inspiration, their moments, but it&#39;s nice to be moving forward.</p>\n<p>I look forward to the next time, when I&#39;ll see you again.</p>\n<hr>\n<p>With love.</p>\n",
      "data": {
        "title": "Memories",
        "date": "2016-11-29T00:00:00.000Z",
        "blurb": "Reminiscing about a wonderful time I had in Montreal."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>For my American friends, before you lash out at what, to many, is a disappointing election result, remember this is the culmination of many problems in the country. Maybe Trump isn&#39;t the way to fix them, but for many, he seemed a way.</p>\n<p>Let&#39;s not wholly label our opponent voters, either on the left or on the right, as monsters and horrible people. There might be a few bad people, but on both sides there&#39;s people&#39;s lives who have been so affected by recent events, and may be affected in the future.</p>\n<p>Hatred will never convince other people people of your own arguments, whatever the merits.</p>\n<p>America (and the world) has been so divided, but please, let&#39;s try one more time to unite.</p>\n<p>If you think the opponent was one of hatred and fear, then please, prove that they were with your love, kindness and trust. Be better, and let&#39;s make the world a better place.</p>\n<hr>\n<p>With love.</p>\n",
      "data": {
        "title": "Election 2016",
        "date": "2016-11-15T00:00:00.000Z",
        "blurb": "Let's hope the future will be better."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>A shorter one this week.</p>\n<p>I wrote this letter to myself shortly after graduation, after returning home. It was something for me to look at, something to keep me going, to keep me inspired to do great things.</p>\n<p>I was, and still am, in a state of discovery - finding myself, my passions, my goals. I think it&#39;s a bit more clear now. There&#39;s a few things that I want to do with life, and a few areas I&#39;m particularly interested and passionate about - the future of humanity, education, technology, politics, and (perhaps most importantly) people. I&#39;m still figuring things out, but I think I have more of an idea of what to do, and the first steps I need to take.</p>\n<p>I hope it can be a (cheesy) source of inspiration and motivation to you, just like all the statuses I (used to) post.</p>\n<hr>\n<p>Dear [Me],</p>\n<p>I know you&#39;ve been feeling down. I know sometimes things seem impossible, and there are no good choices. I know you&#39;ve failed a few times. I know you keep trying, but each time it seems hopeless. I know it feels like time is running out, and opportunities are slipping away.</p>\n<p>But, despite all these challenges, I hope you don&#39;t stop trying.</p>\n<p>I hope every time you fall, you find the strength to pick yourself up again. And when you no longer have that strength, I hope you reach out for help.</p>\n<p>You should be proud of what you have accomplished. You&#39;ve come so far, graduated university, and have had great experiences. You have beautiful, inspirational friends, who care and think about you. You&#39;re a brilliant and passionate individual, with so much potential.</p>\n<p>Yet you and I both know you have not realised that potential.</p>\n<p>So stay hungry.</p>\n<p>You have the potential, so work hard for it.</p>\n<p>There&#39;s so much more in this world to see, so much for you to experience.</p>\n<p>All of the wonders of the universe, of humanity, are out there, waiting. You just need to reach out and seize it. You have everything to lose, the endless bounty of the future.</p>\n<p>But you also have so much to gain.</p>\n<p>You know how hard it&#39;s been, and how hard it will be. But I know you - you hunger, you lust.</p>\n<p>So please, find courage. Faith. Hope.</p>\n<p>Courage to face your fears and anxiety, and overcome them.</p>\n<p>Faith in yourself, that you can find the strength to do what needs to be done.</p>\n<p>Hope, for a better world - one made possible by you.</p>\n<p>Please, just try.</p>\n<p>I know you will.</p>\n<p>And one day, I&#39;ll be very, very, proud.</p>\n<hr>\n<p>Me.</p>\n<p>I hope you too, can reach your dreams, and change the world. It can&#39;t be that hard, can it?</p>\n",
      "data": {
        "title": "An Open Letter",
        "date": "2016-11-01T00:00:00.000Z",
        "blurb": "For when you need motivation."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>Just to get myself back on a two-week schedule, I&#39;ll post this today.</p>\n<p>I promise this is the last dark post, hahaha. I figure that these establish some of my failures and where I come from, and probably serve as a good backdrop. Hopefully the next posts are just fun, interesting, quirky, and growth-minded.</p>\n<p>This is also fairly cocky, but oh well...</p>\n<hr>\n<p>I&#39;ve always been smart.</p>\n<p>From a young age, everyone&#39;s told me &quot;Oh you&#39;re so smart&quot;, &quot;You&#39;re so bright&quot;, and so on. </p>\n<p>And even from a young age, I can&#39;t say that that wasn&#39;t supported. I never needed to try much, and when I did more, I always succeeded.</p>\n<p>Everything came fairly easily to me, I picked up talents and new skills quickly. I grasped difficul things with ease. From learning to sight-read piano, to orienting myself in a new environment, to understanding 2D and 3D NMR, I was never truly out of my depth. </p>\n<p>People have all said I have potential - but to me, I still haven&#39;t realized it. </p>\n<hr>\n<p>I remember going back to China for the second half of Grade 2. As a little sort of background, even in public elementary schools, the Chinese system requires entrance examinations. I did not test well, being placed in what was probably a third-rate school. But I transfered a few weeks in, and by the end of the year I was one of the top scorers at one of the the top schools in the city.</p>\n<p>Even in other things, I tended to be good to great, and mostly without trying.</p>\n<p>This pattern continued through high school, and well into university.</p>\n<p>However, there were finally people who could beat me.</p>\n<p>I didn&#39;t have the highest grades, or the most involvement, or the biggest achievements, but I felt fine about it.</p>\n<p>I mean, I still did decent. More than decent for most people.</p>\n<p>But regardless, I never took the time to be the best. I definitely spent the least time out of anyone who did as well, and I prided myself on that.</p>\n<p>I remember some of my friends who worked so hard, and sure they did better. But I was never far behind. I remember thinking, damn, so much time for just that tiny amount? What a waste of time.</p>\n<p>Looking back, how wrong I was..</p>\n<hr>\n<p>I remember most of my failures, and my successes as well.</p>\n<p>I always used to justify my failures with these successes, and with the &quot;certain&quot; knowledge that - if i had tried - they would&#39;ve been successes too.</p>\n<p>But even my successes never involved much trying.</p>\n<p>I could list some of my accomplishments here.</p>\n<p>41 on the MCAT. 2370 on the SAT. 100th percentile scores, and without much studying. I maybe studied for each for about a week or two, hardly the intensive months-long studying that many use. And I used this to justify my cockiness, my absolute certainty that I was better, that I was smarter, and that I could do whatever.</p>\n<p>Even in university, I had a decent GPA (3.85ish). While many of my friends had higher, most studied so much harder, and I noticed. I could always delude myself, that 4.0 wasn&#39;t that different from my GPA, that their accomplishments were only a little bit better. In the end, it wouldn&#39;t matter, would it?</p>\n<p>And maybe I was right, maybe these small changes, individually, wouldn&#39;t matter. Maybe if you added them all up, it would. Or maybe, the reason, the why, that these were different - that mattered the most. </p>\n<hr>\n<p>I remember getting my final rejection letter from the top US colleges.</p>\n<p>I can&#39;t even pretend it didn&#39;t hurt - it hurt a lot. To my pride, my ego, my confidence, and my belief in myself.</p>\n<p>But pretty soon, I was okay with it. I mean, I hadn&#39;t tried that hard.</p>\n<p>My excuses, I had thought, were all valid. I had skipped Early Action. I had finished on basically the very last day. I hadn&#39;t put that much effort into it. And the worst - that it didn&#39;t matter that much. Life goes on, right? McGill or Berkeley would be almost just as good, what&#39;s the big deal?</p>\n<p>And again, maybe these small differences didn&#39;t matter - but the attitude behind it did.</p>\n<p>Because, three years later, the same thing happened again.</p>\n<p>I wavered, I defended my actions, I applied to medical school, but not really trying to, and once again, I was left with a bunch of rejection letters.</p>\n<p>And just like my marks, my various accomplishments, applying to jobs, succeeding in relationships, and so forth, not trying kept me safe.</p>\n<p>In that little bubble of passivity and self-excusement, I could always maintain the belief that I was fine. It was comfortable, I could do enough, and my worldview would never be challenged, my barriers never be shattered. </p>\n<hr>\n<p>I thought that if I never tried, I could keep believing - that when I <strong>did</strong> try, I would easily succeed.</p>\n<p>Moments came and passed, and I never could.</p>\n<p>I kept waiting for that one moment, that one day, that one dream, that would finally drive me to try and do everything I ever wanted.</p>\n<p>Now, I think, I better understand.</p>\n<hr>\n<p>Trying and discipline is part of how you become stronger.</p>\n<p>I don&#39;t think I&#39;d be content, just living life as it is right now. Having a mediocre life, never really stepping outside my comfort zone, is okay. It&#39;s comfortable, it&#39;s warm - and it&#39;s slowly suffocating me.</p>\n<p>If I never try, if I never strive, and never give something 110%, I&#39;ll never know what it&#39;s like to truly succeed, or to truly fail. I&#39;ll never live, and I don&#39;t think - if I do manage to achieve anything - it&#39;ll be as worthwhile.</p>\n<blockquote>\n<p>Nothing in this world can take the place of persistence. Talent will not: nothing is more common than unsuccessful men with talent. Genius will not; unrewarded genius is almost a proverb. Education will not: the world is full of educated derelicts. Persistence and determination alone are omnipotent.\n<strong>Calvin Coolidge</strong></p>\n</blockquote>\n<p>Maybe I&#39;m missing something. A passion, a clear goal, a dream. A realization that this is all I have. An acceptance that my dreams will never find it&#39;s way to me - I have to do the searching.</p>\n<p>Hence, I&#39;m taking the year to really figure that out.</p>\n<p>I will try, to try.</p>\n<p>My dream hasn&#39;t changed - to change the world.</p>\n<p>I know that I might not reach it, but I will try my best to.</p>\n<hr>\n<p>With love.</p>\n",
      "data": {
        "title": "The Promise of Potential",
        "date": "2016-10-18T00:00:00.000Z",
        "blurb": "It's easy to say - it could have been, and harder to say that you failed."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>I&#39;ve decided to (try and) make this blog bi-weekly, and I&#39;m already a week late, but hey, it&#39;ll work out.</p>\n<p>It&#39;s been a few months out from McGill, and being in a smaller city and at home feels so different. In many ways, it&#39;s been quite lonely. To many of you, I&#39;ve missed you so much. Nonetheless, the region has wonderful people, but it can be a challenge to find and connect with them. I&#39;m sure it&#39;s something that&#39;ll come with time.</p>\n<p><img src=\"https://imgur.com/YrJ5EvZ.jpg\" alt=\"alt text\" title=\"Friends (a)\"></p>\n<p>I know this is the most common thing to say, but thank you all so much, once again. Those of you, my friends and colleagues, have helped make life a much better place for me.</p>\n<p>One of the funnier things that&#39;s happened throughout these last years, and one of the biggest changes to me, is how much I value and am affected by others.</p>\n<p>When I first immigrated to Canada, and for quite a long time after, I was freakishly scared of meeting new people and of talking to friends. I remember asking my parents to do so much for me, from asking for condiments from waitresses (lol) to consciously choosing to avoid what friends I did have.</p>\n<p>And these supplemented my various hobbies, most notably that of gaming. I still game (a bit), but never to quite the same degree of social avoidance.\nHad I not been able to (or had I not met people who could get me to) meet some of you, how boring and lonely my life would have been.</p>\n<hr>\n<p>I think I&#39;m still dealing with some of these issues still. I know for myself that it is so difficult to admit mistakes, and to ask for both help and forgiveness. Perhaps especially the help. Part of that can be attributed to pride, but another part to the fear of rejection.</p>\n<p>I know how hard I agonized over asking professors for letters of recommendation. Over asking a girl out. Over asking for opportunities.</p>\n<p>I think I&#39;ve recognized some of these barriers. The fear of failure, and of keeping the potential and the hope alive, was so real. It&#39;s so much easier just to never try, to never give it your all, and just say that &quot;Don&#39;t worry, I can do it, I just need to find the right moment.&quot; That&#39;s probably a longer topic.</p>\n<p>I also know that I&#39;m a really cocky individual. I definitely resort to teasing, to trash-talking, etc., in social situations. Sometimes it&#39;s for fun. Other times its a little bit defensive, to make sure no one knows my weaknesses, and to deflect anything that might harm me or force me to think and talk about things I&#39;m scared of.</p>\n<p>Thank you to the friends who showed me the beauty of humanity.</p>\n<p>And thank you to the friends who cared enough to break down my walls.</p>\n<p>Some things have gotten better. I think I&#39;m much better at opening up to friends, and at making new meaningful relationships.</p>\n<p>Other things still need work. Maybe a cocky attitude needs to be toned down. Maybe a few innate defenses still need to be overcome. I definitely still need to be able to talk to certain people better. And maybe to be a bit more appropriate and mature.</p>\n<p>I could blame it on society, on the attitudes of coldness and of image, on the need to maintain a facade of strength. We&#39;ve seen the books and stories lamenting the attitudes of modern society, blaming sources from advertisement to feminism for creating what some term a generation of meaningless and superficial people. But we can all change.</p>\n<p><img src=\"https://imgur.com/qUXWQQW.jpg\" alt=\"alt text\" title=\"Friends (b)\"></p>\n<p>I think opening up to each other is one of the most beautiful things of friendship and love.</p>\n<p>The trust, the understanding, the acceptance, and the human touch are things that we can&#39;t simply emulate, but require this deeper connection between each other.</p>\n<p>In many ways, this support has been invaluable.</p>\n<hr>\n<p>To amp the cheesiness factor to 11, but to try and be serious, friendship has definitely been something that changed my life.</p>\n<p>I&#39;ve said this before, and I&#39;ll say this again: I would&#39;ve never made it this far without your friendship and love.</p>\n<p>Having you guys to talk to, to confess to, to trust in, is something that I can rely on even when I can&#39;t continue on.</p>\n<p>How lonely it would be without.</p>\n<p>The support, the care, the love, is something that I will always treasure.</p>\n<p>Being able to reach out, and have someone listen, someone to offer advice and company, and someone to be a shoulder to cry on, is something that will always reassure me. I know that someone will be there to catch me when I fall.</p>\n<p>Talking about dreams, inspiring one another, and pushing each other to new heights is another that I will need, heading into an uncertain future. But some of these conversations, some of these debates, are what drive me and what ignites a small spark in my heart.</p>\n<p>And being there for others, being able to understand, and to help, has allowed me to realize that that is one of my deepest passions.</p>\n<p>It&#39;s also been so amazing to know that others feel similarly. To summarize my feelings with a quote: </p>\n<blockquote>\n<p>&quot;Friendship ... is born at the moment when one man says to another &#39;What! You too? I thought that no one but myself...&#39;&quot;\n<strong>C. S. Lewis</strong></p>\n</blockquote>\n<hr>\n<p>So, thanks for all of the parties. For making life brighter and happier, and full of excitement.</p>\n<p>Thanks for all the conversations. For giving life emotion and meaning.</p>\n<p>Thanks for all the dinners. For giving life vibrancy and wisdom, and companionship.</p>\n<p>And thanks for all the things that I can&#39;t fit in a few sentences, for giving life both a past and a future.</p>\n<p>This is my promise: to keep in touch, and to stay in each others lives.</p>\n<p>If you&#39;re reading this, and are ever in Toronto, please reach out. I&#39;d love to catch up.</p>\n<p>If you ever need someone to talk to, I&#39;ll be there.</p>\n<p>I&#39;m going to steal a campaign slogan, but truly, we will be stronger together.</p>\n<p>And please, let me say hi :)</p>\n<hr>\n<p>With love.</p>\n",
      "data": {
        "title": "Life: the Human Connection",
        "date": "2016-10-11T00:00:00.000Z",
        "blurb": "Wondering about loneliness and friendship."
      },
      "isEmpty": false,
      "excerpt": ""
    },
    {
      "content": "<p>So, this marks the first post on this blog.</p>\n<p>This is a goodbye, but also a new start (clich). I&#39;ve been in Montreal for three years, three of the best (and worst) and most impactful years of my life, and I am definitely sad to leave it behind.</p>\n<p>I am currently back in Cambridge, Ontario. It kinda sucks here, and it&#39;s kinda lonely. I don&#39;t think small towns are my favorite, and I definitely feel the lack of things to do. But maybe this is good: a new start, where I can focus on myself and really figure out what I want to do with life.\nBut first things first. This blog.</p>\n<p>This will be the story of my life (as challenged by Jonathan Leung). I hope it&#39;s a collection of small stories, life reflections, wisdom, success, failures, and general things. I hope it&#39;s something that can both record my thoughts, and offer it to others. And I sincerely hope that you can find some wisdom, some advice, some learning, and some emotion from reading these. If not, I hope at least that at least it&#39;s entertaining.</p>\n<p>As to this first post?</p>\n<p>Well, the classic &quot;This Is Who I Am&quot; probably applies. My past, my future, my current thoughts about life. Y&#39;know, a self-summary of sorts, to set things on the right path.</p>\n<p><img src=\"https://imgur.com/T83DuLg.jpg\" alt=\"alt text\" title=\"Picture of Montreal\"></p>\n<p>This post marks my 21st birthday. A bigger day in some countries, but nonetheless a big day. It also marks the first birthday that I&#39;m celebrating outside of school. It also marks about a quarter of life.... and a quarter-life existential crisis.</p>\n<p>I have been thinking a lot recently.</p>\n<p>Sure I - we - have been through a lot. But there is so much more to come.</p>\n<p>Sometimes I feel really old - that my &quot;potential&quot; has been wasted, and that there&#39;s not much more to come. I feel like I&#39;ve failed so much, and left so much behind, that it&#39;s become a heavy weight dragging on me as I move forward. It&#39;s so easy to look at other people&#39;s success with a bit of jealousy and envy, and wish that that was me.</p>\n<p>And I think it hurts especially knowing that - I could have done it. &quot;Potential&quot; remains a specter, haunting over my own seemingly mediocre achievements, knowing (or believing) that I could&#39;ve been something more. And it&#39;s so easy to hate, to believe that I am my own worst enemy. That all I ever wanted could have happened - if I wasn&#39;t me.</p>\n<p>I know that in many ways, I&#39;m scared. I&#39;ve been scared of so many things, of failure, of trying new things, of talking to new people, etc. Sometimes it&#39;s so limiting: pushing the things I&#39;m scared of away, leaving them to the last minute, never trying - and never failing. But ultimately, roads slowly begin to close, and I feel more trapped than ever in this bubble of safety, though that safety was only ever an illusion. And eventually, things seem impossible.</p>\n<p>I think it doesn&#39;t have to be this way.</p>\n<hr>\n<p>On another note; McGill has contained some of the best times of my life.</p>\n<p>I don&#39;t think I&#39;ll ever have quite as many friends, or go out quite as much, or try so many new things, or truly feel free in the same way.</p>\n<p>I definitely know, however, that I would&#39;ve never made it through without all of you &lt;3. Seriously. Thank you, sincerely. I mean that from the bottom of my heart. From dank memes, to late night conversations, to tearful confessions, to random moments of fun.</p>\n<p>Some of the times at McGill have been absolutely terrible, and I know that it would&#39;ve been all too easy to waver and give up. I&#39;m so glad that you&#39;ve all seen and helped me grow, and I do think that your support, your wisdom, and your company have been invaluable. I know this sounds so vague and unspecific, but please, believe, you matter. I&#39;m going to refrain from calling people out, but I have treasured even the smallest gestures.</p>\n<p>I&#39;ve learned so much from each of you, and these experiences have opened my eyes. I&#39;d love to think I&#39;m a better and stronger person now.</p>\n<p>This is also me saying sorry. I know it probably won&#39;t be read (especially if I have wronged you, aka the target of this message), but I&#39;m sorry to all those I&#39;ve let down. You know who you are, and I do too. I&#39;d love to use the excuse of stress and uncertainty, but that&#39;d be extremely disrespectful to you. In many ways, I just wasn&#39;t enough. I want to promise that I will never let you down again, but that&#39;d be a promise that I can&#39;t uphold. But regardless, I hope for forgiveness, perhaps one day.</p>\n<hr>\n<p>In terms of hard decisions, one of the hardest I&#39;ve made is this: I am (indefinitely) delaying medical school.</p>\n<p>Right now, quite frankly, I&#39;m not ready. I sometimes wish I could say I was, and I sometimes just want to leave sciences forever and never look back. I think I would enjoy so many aspects of the job, the care for people, the making lives better, the value given to the community and the world. But I&#39;m afraid of so much, the pressure, the stress, the anxiety, and the unshakable feeling that it&#39;s a commitment for life. Even these application processes make me feel paralyzed.</p>\n<p>Now, I have nothing against pre-meds. Throughout my time, I&#39;ve met some of the most passionate and amazing people striving to be a doctor. I wish all of you well. I admire your hard work, your dedication to success, and your willingness to see this through. That&#39;s something I could never do. And believe me, I&#39;ve tried, so, so many times, to work as hard as you can. You deserve this, much more than I do.</p>\n<p>I really wish I could&#39;ve tried harder. Believe me, I tried so many times, but each time I failed. Maybe it means I&#39;m not mature enough, or maybe not passionate enough. That, I will hopefully see (and hopefully change) throughout these next years. But that&#39;s in the past. Even making this decision feels like a huge weight off my chest (though please don&#39;t tell my parents yet). I know that taking time to really think things though and find out what I really love will be for the better.</p>\n<hr>\n<p>So yeah. I have no idea what I&#39;m doing. I&#39;m currently picking up coding, trying to reorient myself and figure out for sure what I truly want. I know some of the things that make me feel alive. Talking and hanging out with some of you, for example. Seeing the world. Watching my creations come to life. Solving tough problems.</p>\n<p>There&#39;s a ton of things I want to try. Visiting (and living) so many cities, talking to interesting strangers and seeing their stories, improving the lives of those around me, creating fun and/or vibrant memories, and so on. I want to go to EDM festivals in the US and Europe. I want to meet a cute girl in Paris or Vienna and have a tragically romantic evening. I want to climb the Andes and see ancient ruins. I want to create something, and leave something behind that&#39;s worthwhile.</p>\n<p>I hope that many of these small things work. Working out well again, eating well, sleeping well. Making sure that I can study well each day, add to my portfolio or skills. Talk to someone new, maybe start something interesting. And most of all, when I recognize opportunity, to have the courage to take it.</p>\n<p>This is my promise to be better.</p>\n<p>I have high hopes for this year (yeah, right after this depressing and depressingly-long read). I know that a ton of obstacles await me, but I believe that I&#39;ll be able to overcome them. If I fail, I hope that you&#39;ll be there waiting, to talk to me and to bring me back up. And I hope to do the same for you, to hear your own triumphs and failures, and do whatever I can.</p>\n<p>When I see you again, I know we&#39;ll have many stories to share, but many, many more to live.</p>\n<hr>\n<p>With Love.</p>\n",
      "data": {
        "title": "A New Beginning",
        "date": "2016-09-20T00:00:00.000Z",
        "blurb": "The first post on my site, and the first of my blog."
      },
      "isEmpty": false,
      "excerpt": ""
    }
  ]
}
